app/Controllers/Main/Dashboard.php

SELECT *
FROM `users`
WHERE `username` = 'TEST'
 LIMIT 1
---
    public function signin()
    {
        helper(['form']);
        if ($this->request->getMethod() === 'post') {
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');


        $userModel = new UserModel();

        $user = $userModel->where('username',$username)->first();